; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob8) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate9)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 396)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 277)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 29)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(= (weight crate1) 62)
	(at crate2 distributor1)
	(on crate2 crate1)
	(= (weight crate2) 17)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(= (weight crate3) 85)
	(at crate4 distributor1)
	(on crate4 crate2)
	(= (weight crate4) 73)
	(at crate5 distributor1)
	(on crate5 crate4)
	(= (weight crate5) 57)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 1)
	(at crate7 distributor1)
	(on crate7 crate5)
	(= (weight crate7) 52)
	(at crate8 depot0)
	(on crate8 crate0)
	(= (weight crate8) 9)
	(at crate9 distributor1)
	(on crate9 crate7)
	(= (weight crate9) 20)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 crate4)
		(on crate2 crate6)
		(on crate3 pallet2)
		(on crate4 pallet0)
		(on crate5 crate3)
		(on crate6 crate1)
		(on crate7 pallet1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 1
   goals met: 0 of 7
3. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 7
4. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 1 to 0
   goals met: 0 of 7
5. (lift hoist0 crate8 crate0 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate0)
   added: (lifting hoist0 crate8) (clear crate0)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 7
6. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 7
7. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 9
   goals met: 0 of 7
8. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 7
9. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 7
10. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 9 to 38
   goals met: 0 of 7
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 7
12. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 38 to 123
   goals met: 0 of 7
13. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 34 to 44
   goals met: 0 of 7
14. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 1
   goals met: 0 of 7
15. (lift hoist2 crate9 crate7 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate7)
   added: (lifting hoist2 crate9) (clear crate7)
   changed: (fuel-cost) from 44 to 45
   goals met: 0 of 7
16. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 1 to 21
   goals met: 0 of 7
17. (lift hoist2 crate7 crate5 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate5)
   added: (lifting hoist2 crate7) (clear crate5)
   changed: (fuel-cost) from 45 to 46
   goals met: 0 of 7
18. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 123 to 175
   goals met: 0 of 7
19. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 21 to 20
   goals met: 0 of 7
20. (drop hoist2 crate6 crate5 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate5)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate5)
   goals met: 0 of 7
21. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 175 to 90
   goals met: 0 of 7
22. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 46 to 56
   goals met: 0 of 7
23. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 90 to 38
   goals met: 0 of 7
24. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 56 to 66
   goals met: 0 of 7
25. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 1 of 7
26. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 20 to 105
   goals met: 1 of 7
27. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate5)
   added: (lifting hoist2 crate6) (clear crate5)
   changed: (fuel-cost) from 66 to 67
   goals met: 1 of 7
28. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 105 to 106
   goals met: 1 of 7
29. (lift hoist2 crate5 crate4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate4)
   added: (lifting hoist2 crate5) (clear crate4)
   changed: (fuel-cost) from 67 to 68
   goals met: 1 of 7
30. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 106 to 163
   goals met: 1 of 7
31. (lift hoist2 crate4 crate2 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 68 to 69
   goals met: 1 of 7
32. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 38 to 111
   goals met: 1 of 7
33. (lift hoist2 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate1)
   added: (lifting hoist2 crate2) (clear crate1)
   changed: (fuel-cost) from 69 to 70
   goals met: 1 of 7
34. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 163 to 180
   goals met: 1 of 7
35. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 180 to 179
   goals met: 1 of 7
36. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 70 to 80
   goals met: 1 of 7
37. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 179 to 180
   goals met: 1 of 7
38. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 111 to 38
   goals met: 1 of 7
39. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 2 of 7
40. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 80 to 81
   goals met: 2 of 7
41. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 180 to 242
   goals met: 2 of 7
42. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 81 to 91
   goals met: 2 of 7
43. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 242 to 180
   goals met: 2 of 7
44. (drop hoist0 crate1 crate4 depot0)
   deleted: (lifting hoist0 crate1) (clear crate4)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate4)
   goals met: 3 of 7
45. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 91 to 101
   goals met: 3 of 7
46. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 180 to 95
   goals met: 3 of 7
47. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 101 to 111
   goals met: 3 of 7
48. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet2)
   goals met: 4 of 7
49. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 95 to 94
   goals met: 4 of 7
50. (drop hoist0 crate6 crate1 depot0)
   deleted: (lifting hoist0 crate6) (clear crate1)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate1)
   goals met: 5 of 7
51. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 94 to 77
   goals met: 5 of 7
52. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 111 to 121
   goals met: 5 of 7
53. (unload hoist2 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck1) from 77 to 20
   goals met: 5 of 7
54. (drop hoist0 crate2 crate6 depot0)
   deleted: (lifting hoist0 crate2) (clear crate6)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate6)
   goals met: 6 of 7
55. (drop hoist2 crate5 crate3 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate3)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate3)
   goals met: 7 of 7
